/*Складіть програму, яка підраховує і виводить на екран значення змінних t1 і t2, що обчислюються за формулами,
 * які наведені у виданому варіанті індивідуального завдання (див. п. 6). 
 * Визначте області допустимих значень змінних, які присутні в формулах, 
 * і задайте довільні значення з цих областей. 
 * Змінні, які мають імена m і n – цілі, решта змінних мають тип – з рухомою крапкою. 
 * Значення змінних з іменами x і у повинні вводитися з клавіатури,
 * значення інших – задаватися як початкові значення при оголошенні відповідних змінних.
 * Допускається (і навіть бажано) спростити/розкласти формули для того, щоб забезпечити мінімізацію об’єму обчислень. */
using System;

class Program
{
    static void Main()
    {
        
        double x, y;

        double a = 12.5;
        double b = 1.3;
        int n = 3; 
 
        double t1, t2; 
 
        Console.Write("Введіть значення x: ");
        x = Convert.ToDouble(Console.ReadLine());

        Console.Write("Введіть значення y: ");
        y = Convert.ToDouble(Console.ReadLine());
 
        t1 = 1 / a * ((-1 / ((n - 2) * Math.Pow(x, n - 2))) + (b / ((n - 1) * Math.Pow(x, n - 1))));

        t2 = (2 * x / Math.Pow(a, 2)) * Math.Sin(a * x) - (Math.Pow(x, 2) / a - 2 / Math.Pow(a, 3)) * Math.Cos(a * x);

        Console.WriteLine($"t1 = {t1}");
        Console.WriteLine($"t2 = {t2}");
    }
}
